compose_music_api/app/controllers/songs_controller.rb

	def create
		@song = Song.new(song_params)
		@song.save
---
INSERT INTO "songs" ("title", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test2"], ["created_by", "shieh"], ["created_at", "2018-04-12 15:43:58.379757"], ["updated_at", "2018-04-12 15:43:58.379757"]]