app/controllers/beats_controller.rb

	def index
		@song = Song.find(params[:song_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@beat = Beat.new(beat_params)
		@beat.save
---
INSERT INTO "beats" ("instrument", "created_at", "updated_at", "song_id", "bits") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["instrument", "Side Stick/Rimshot"], ["created_at", "2018-04-16 08:25:38.405235"], ["updated_at", "2018-04-16 08:25:38.405235"], ["song_id", 1], ["bits", "0000000000100000"]]